{"doe":[
	{
		"name": "Monou Fuuma",
		"name_japanese": "桃生 封真",
		"image": "monou-fuuma.png",
		"information": "Kamui's and childhood friend and neighbour. Despite his childhood promise to always protect Kamui (or perhaps because of it? promises and wishes are tricky things in X-verse), Fuuma is in reality Kamui's twin star, his opposite. When Kamui finally chooses to become a Dragon of Heaven, Fuuma inmediately becomes the Dark Kamui, one of the Dragons of Earth."
	},
	{
		"name": "Kuzuki Kakyou",
		"name_japanese": "玖月 牙暁",
		"image": "kuzuki-kakyou.png",
    "information": "SO SAD"
	},
	{
		"name": "Sakurazuka Seishirou",
		"name_japanese": "桜塚 星史郎",
		"image": "sakurazuka-seishirou.png",
		"information": "Seishirou is actually the sakurazukamori, an assasin who uses onmyoujitsu to kill his intended victims. He has a particularly complicated relationship (bit of an understatement) with Sumeragi Subaru, Dragon of Heaven and head of the Sumeragi clan. He has no particular interest in the battle for the end of the world, outside the fact that it's brought Subaru back into his life after 9 years."
	},
	{
		"name": "Nataku",
		"name_japanese": "那吒",
		"image": "nataku.png",
    "information": " Nataku is a \"genderless bioroid\", an artificial but genetically perfect human, created from the body of a girl who passed away and that of her father, who sacrificed himself so she could be brought back by her grandfather. Nataku supposedly has no emotions, but in reality comes to love Fuuma and the Dragon of Heaven Kasumi Karen, seeing them as surrogate parents."
	},
	{
		"name": "Kigai Yuuto",
		"name_japanese": "麒飼 遊人",
		"image": "kigai-yuuto.png",
    "information": "One of X's most enigmatic and mysterious characters. Yuuto is handsome, charming, has impeccable manners, and is quite the ladies' man. He describes himself as a \"simple government employee\". He is mellow and appears to be mostly amused at the world around him, and follows his path as a Dragon of Earth with no particular passion. He is a water master, but doesn't use the power all that often."
	},
	{
		"name": "Yatouji Satsuki",
		"name_japanese": "八頭司 颯姫",
		"image": "yatouji-satsuki.png",
    "information": "Satsuki frighteningly intelligent computer genius who wreacks havoc in Tokyo by hooking herself up to Beast, a somewhat sentient super computer that enables her to hack into any computerized network in Tokyo. She believes humans are boring creatures and feels no particular affinity or respect for the rest of humanity, and therefore has no particular compunctions about killing other humans."
	},
	{
		"name": "Shiyuu Kusanagi",
		"name_japanese": "志勇 草薙",
		"image": "shiyuu-kusanagi.png",
    "information": "Kusanagi is a soldier in the japanese army and feels a particularly strong affinity towards nature. He meets and befriends a young girl named Nekoi Yuzuriha, who is actually one of the Dragons of Heaven."
	},
	{
		"name": "Asagi Shougo",
		"name_japanese": "浅黄 笙悟",
		"image": "asagi-shougo.png",
		"information": "Asagi Shougo only appears in the movie, because at the point it was made the manga's final Dragon of Earth, Kuzuki Kakyou, had not appeared. He is a high school student and a water master, like Yuuto."
	}
]}