{"kekkai":[
	{
		"name": "Nakano Sun Plaza",
		"name_japanese": "中野サンプラザ",
		"name_romanji": "Nakano San Puraza",
		"latitude": 35.707522,
        "longitude": 139.664684,
        "manga_is_kekkai": "Yes",
        "tv_is_kekkai": "No",
        "movie_is_kekkai": "Yes",
        "manga_destroyed": "Yes",
        "movie_destroyed": "Yes",
        "manga_attacked_by": "Sakurazuka Seishirou",
        "movie_attacked_by": "Sakurazuka Seishirou",
        "information": "A cultural hall in the Nakano ward, west of Shinjuku, internationally known as a musical venue. Destroyed by Sakurazuka Seishirō in the manga_ and the motion picture. Nakano Sun Plaza did not appear as a barrier in the television series. This building's appearance might have related to the fact that Clamp worked with Tanaka Yoshiki in Sohryūden (Kodansha bunko). Nakano ward is a place where the heroes of Sohryūden live. Interestingly, Nakano is considered \"sacred ground\" for otaku in Japan."
	},
	{
		"name": "Sunshine 60",
		"name_japanese": "サンシャイン 60",
		"name_romanji": "Sanshain 60",
		"latitude": 35.729583,
        "longitude": 139.717778,
        "manga_is_kekkai": "Yes",
        "tv_is_kekkai": "Yes",
        "movie_is_kekkai": "Yes",
        "manga_destroyed": "Yes",
        "tv_destroyed": "Yes",
        "movie_destroyed": "Yes",
        "manga_attacked_by": "Monou Fuuma, Nataku",
        "tv_attacked_by": "Monou Fuuma, Nataku",
        "movie_attacked_by": "Nataku",
        "information": "A sixty-story skyscraper in the Ikebukuro district of the Toshima ward, well known for its myriad shops, novelty restaurants, aquarium, and SKYMAX planetarium. Destroyed by Monou Fūma and Nataku in the manga_ and the television series, destroyed by Nataku in the motion picture. Ikebukuro is also featured prominently in Tokyo Babylon."
	},
	{
		"name": "Yamanote Line/Tokyo Station",
		"name_japanese": "山手線/東京駅",
		"name_romanji": "Yamanotesen/Tōkyōeki",
		"latitude": 35.680833,
        "longitude": 139.766944,
        "manga_is_kekkai": "Yes",
        "tv_is_kekkai": "Yes",
        "movie_is_kekkai": "Yes",
        "manga_destroyed": "Yes",
        "tv_destroyed": "No",
        "movie_destroyed": "Yes",
        "manga_attacked_by": "Monou Fuuma",
        "tv_attacked_by": "Kigai Yuuto",
        "movie_attacked_by": "Asagi Shougo",
        "information": "The busiest mass transit rail line in Tokyo, encircling much of the city in the shape of the Amida Butsu's hand with the Imperial Palace roughly at its center. Destroyed by Asagi Shōgo in the motion picture, destroyed by Monou Fūma in the manga_, and (nearly) derailed by Kigai Yūto in the television series. Notably, the Yamanote Line may have been the most powerful barriers in Tokyo other than Tokyo Tower; it was a linear barrier that covered a vast area of the city with its protection. In the manga_, when Fūma broke just a small section of the Yamanote Line in Shibuya, every station along the line was destroyed in rapid succession—his explanation for this being that all one need do to completely compromise the protection of a circle is to breach it at but one point."
	},
    {
        "name": "Shinjuku Highrises",
        "name_japanese": "新宿副都心",
        "name_romanji": "Shinjuku Fukutoshin",
        "latitude": 35.689444,
        "longitude": 139.695,
        "manga_is_kekkai": "Yes",
        "tv_is_kekkai": "Yes",
        "movie_is_kekkai": "Yes",
        "manga_destroyed": "Yes",
        "tv_destroyed": "Yes",
        "movie_destroyed": "Yes",
        "manga_attacked_by": "Yatouji Satsuki",
        "tv_attacked_by": "Yatouji Satsuki",
        "movie_attacked_by": "Shiyuu Kusanagi, Kigai Yuuto",
        "information": "The many skyscrapers of the Shinjuku ward, the administrative and commercial center of Tokyo. Destroyed by Yatōji Satsuki in the manga_ and the television series, destroyed by Shiyū Kusanagi and Kigai Yūto in the motion picture."
    },
    {
        "name": "Shibuya 109",
        "name_japanese": "渋谷 109",
        "name_romanji": "Shibuya Ichimarukyū",
        "latitude": 35.659544,
        "longitude": 139.699011,
        "manga_is_kekkai": "Yes",
        "tv_is_kekkai": "No",
        "movie_is_kekkai": "No",
        "manga_destroyed": "Yes",
        "manga_attacked_by": "Sakurazuka Seishirou",
        "information": "A landmark building in the Shibuya shopping district famous for its trend-setting department store. Destroyed by Sakurazuka Seishirō in the manga_. Shibuya 109 does not appear as a barrier in the television series or the motion picture."
    },
    {
        "name": "Ebisu Garden Place",
        "name_japanese": "恵比須ガーデンプレイス",
        "name_romanji": "Ebisu Gaaden Pureisu",
        "latitude": 35.646643,
        "longitude": 139.710045,
        "manga_is_kekkai": "Yes",
        "tv_is_kekkai": "No",
        "movie_is_kekkai": "No",
        "manga_destroyed": "Yes",
        "manga_attacked_by": "Monou Fuuma",
        "information": "A popular shopping district in Tokyo with many sidewalk cafes and fashion boutiques. Destroyed by Monou Fūma (with cans of tea) in the manga_. Ebisu does not appear as a barrier the television series or the motion picture."
    },
    {
        "name": "Rainbow Bridge",
        "name_japanese": "レインボーブリッジ",
        "name_romanji": "Reinbō Burijji",
        "latitude": 35.636389,
        "longitude": 139.763611,
        "manga_is_kekkai": "Yes",
        "tv_is_kekkai": "Yes",
        "movie_is_kekkai": "No",
        "manga_destroyed": "Yes",
        "tv_destroyed": "Yes",
        "manga_attacked_by": "Sakurazuka Seishirou",
        "tv_attacked_by": "Sakurazuka Seishirou",
        "movie_attacked_by": "Did not appear as kekkai",
        "information": "A landmark bridge across Tokyo Bay connecting Tokyo with the Odaiba district in the Minato ward, which was built on reclaimed land. Destroyed by Sakurazuka Seishirō in the manga_ and the television series. Rainbow Bridge did not appear as a barrier in the motion picture."
    },
    {
        "name": "The National Diet Building",
        "name_japanese": "国会議事堂",
        "name_romanji": "Kokkai Gijidō",
        "latitude": 35.67571,
        "longitude": 139.74481,
        "manga_is_kekkai": "No",
        "tv_is_kekkai": "No",
        "movie_is_kekkai": "Yes",
        "movie_destroyed": "Yes",
        "movie_attacked_by": "Monou Fuuma",
        "information": "The chief legislative building of the Japanese government. Hinoto is housed in the basement of the National Diet. Destroyed by Monou Fūma in the motion picture. It does not appear as a barrier in the manga_ (although it is pictured when referring to the two remaining barriers in volume 18, the two barriers in question are actually Tokyo Tower and Tokyo Metropolitan Government Building) and despite the fact that it appears to act as a barrier in the television series, it is never destroyed let alone attacked."
    },
    {
        "name": "Ginza",
        "name_japanese": "銀座",
        "name_romanji": "Ginza",
        "latitude": 35.671217,
        "longitude": 139.765007,
        "manga_is_kekkai": "Yes",
        "tv_is_kekkai": "No",
        "movie_is_kekkai": "No",
        "manga_destroyed": "No",
        "manga_attacked_by": "Monou Fuuma, Nataku",
        "information": "(Yet another) shopping district in Tokyo, known for many department stores, coffee shops, and restaurants. Attacked (but not destroyed) by Nataku and Monou Fūma in the manga_. Ginza does not appear as a barrier in the motion picture. Apparently, the Ginza barrier is specifically embodied by the Wakō Building Clocktower."
    },
    {
        "name": "Inokashira Park",
        "name_japanese": "井の頭公園",
        "name_romanji": "Inokashira Kōen",
        "latitude": 35.700833,
        "longitude": 139.574167,
        "manga_is_kekkai": "Yes",
        "tv_is_kekkai": "Yes",
        "movie_is_kekkai": "No",
        "manga_destroyed": "Yes",
        "tv_destroyed": "Yes",
        "manga_attacked_by": "Yatouji Satsuki",
        "tv_attacked_by": "Monou Fuuma",
        "information": "A large, lush park in the midst of the city of Mitaka within Tokyo. Destroyed by Monou Fūma in the television series, and attacked (although not destroyed) by Yatōji Satsuki in the manga_. Inokashira Park does not appear as a barrier in the motion picture. Inokashira Park is home to a shrine dedicated to the vengeful goddess of love, Benzaiten. According to folklore, she causes the relationships of young couples to come to premature ends—which is interesting in that the incident at Inokashira Park (in which Sorata is grievously injured attempting to protect Arashi with his gohōdōji) causes Arashi to realize how much she loves Sorata and — in the anime — to consequently break from the Dragons of Heaven to try to save Sorata from his lethal fate."
    },
    {
        "name": "Yasukuni Shrine",
        "name_japanese": "靖國神社",
        "name_romanji": "Yasukuni Jinja",
        "latitude": 35.694167,
        "longitude": 139.743056,
        "manga_is_kekkai": "No",
        "tv_is_kekkai": "No",
        "movie_is_kekkai": "No",
        "information": "A shrine in Tokyo dedicated to all fallen Japanese soldiers. Yasukuni Shrine does not appear as a barrier in the manga_ (although Seiichirō has Daisuke and Yuzuriha meet him there), and it does not appear at all in the motion picture. In the television series, it may or may not be an actual barrier, but (as in the manga_), the Dark Hinoto lies to the Seals, telling them that there will be an attack at Yasukuni Shrine in order to divide their forces.\n\nNotably, the Kadokawa Shoten headquarters is in the vicinity of the shrine, perhaps the reason why Aoki Seiichirō (who is based on the real Aoki Seiichirō, editor of Monthly Asuka, a division of Kadokawa), an editor of Kadokawa's Asuka magazine in X, is able to get to the shrine with relative ease."
    },
    {
        "name": "Tokyo Metropolitan Government Building",
        "name_japanese": "東京都庁",
        "name_romanji": "Tōkyō Tochōsha",
        "latitude": 35.689722,
        "longitude": 139.692222,
        "manga_is_kekkai": "Yes",
        "tv_is_kekkai": "Yes",
        "movie_is_kekkai": "Yes",
        "manga_destroyed": "No",
        "tv_destroyed": "No",
        "movie_destroyed": "No",
        "information": "The administrative neural center of Tokyo, this landmark building was constructed after the fashion of a European gothic cathedral façade, with its distinctive belltower-like twin peaks. Tokyo Metropolitan Government Building is in the very heart of the Shinjuku ward and acts as the headquarters of Tokyo's governing body. The headquarters of the Dragons of Earth is directly beneath it, as well (some of its highlights including a throne that smacks of phallic imagery, Kanoe's shower and bedroom—which Yūto always seems to be in—and the cold storage chamber that the Beast is housed in). In the manga_ and television series, although Yatōji Satsuki destroyed the Shinjuku Highrises, it was left untouched. Indeed, it seems that in all of Hinoto's and Kakyō's dreams of the future which the Dragons of Earth are working towards, although Tokyo will be otherwise obliterated and flooded, the Metropolitan Government Building is still standing undamaged amidst several metres of water. It is unknown as to whether the Dragons of Earth intend to destroy it as well as Tokyo Tower, but it seems—at least at the moment—unlikely."
    },
    {
        "name": "Tokyo Tower",
        "name_japanese": "東京タワー",
        "name_romanji": "Tōkyō Tawā",
        "latitude": 35.658611,
        "longitude": 139.745556,
        "manga_is_kekkai": "Yes",
        "tv_is_kekkai": "Yes",
        "movie_is_kekkai": "Yes",
        "manga_destroyed": "No",
        "tv_destroyed": "No",
        "movie_destroyed": "No",
        "tv_attacked_by": "Monou Fuuma",
        "movie_attacked_by": "Monou Fuuma",
        "information": "Perhaps the most important barrier. A landmark of red and white steelwork done in the style of Paris's Eiffel Tower, Tokyo Tower is the final barrier. Tokyo Tower is a central recurring landmark in many of Clamp's works (including Tokyo Babylon, Cardcaptor Sakura, Magic Knight Rayearth, and Clamp School Detectives). In the motion picture and television series, Tokyo Tower is attacked by Monou Fūma, though in each of these instances Shirō Kamui manages to prevent him from destroying it. In the manga_, it remains to be seen as to whether Tokyo Tower will survive the Final Battle."
    }
]}